INTRODUCTION TO DATAFRAME

In [85]:
import pandas as pd

dike = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=["A", "B", "C"])
dike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

Assignment

In [86]:
import pandas as pd

data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Math': [85, 90, 78, 92],
    'Science': [88, 76, 93, 85]
}

df = pd.DataFrame(data)
df
# math scores
df.tail(1)

  Student  Math  Science
3   David    92       85

LOADING CSV

In [87]:
import pandas as xys

info = xys.read_csv('./files/airtravel.csv')
info

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [88]:
import pandas as abc

bank = abc.read_csv('./files/custom.csv')

bank

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Statement,Unnamed: 6
0,NaN,NaN,NaN,NaN,Account,Date,NaN
1,"DIKE, CHRISTOPHER EBUKA",NaN,NaN,NaN,2006454436,03/01/2024 - 03/05/2024,NaN
2,NO 7 IRETI CLOSE KINS,NaN,NaN,NaN,NaN,NaN,NaN
3,"WATER ISASHI OJO LAGOS,",NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,Opening Balance,Closing Balance,NaN
...,...,...,...,...,...,...,...
449,14:40:56,transfer,Bank For Africa,NaN,NaN,NaN,NaN
450,Kuda MF Bank (RC796975). All rights reserved. ...,NaN,NaN,NaN,NaN,NaN,NaN
451,is licensed by the Central Bank of Nigeria. “K...,NaN,NaN,NaN,NaN,NaN,NaN
452,NaN,"Lagos. Nigeria. 131 Finsbury Pavement, London,...",NaN,NaN,NaN,NaN,NaN
453,Account Number : 2006454436,NaN,Page 8 of 8,NaN,NaN,NaN,NaN